/**
 * @param {String[]} phones - Неформатированные тел. номера
 * @returns {String[]} - Маскированные тел. номера
 *
 * @description Функция принимает на вход массив телефонных номеров и 
 * модифицирует их на месте, превращая к виду `+код (ххх) ххх-хх-хх` 
 *
 * @example
 * const phones = ['+79111112233','+79111112244','+79111112255','+79111112266']
 * console.log(phones) // ['+7 (911) 111-22-33', '+7 (911) 111-22-44', '+7 (911) 111-22-55', '+7 (911) 111-22-66']
 */
export function formatPhones(phones) {
    return {}
}
